alarmservices/examples/AuthenticatedRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://prashanth.cpm/spring/soap/api/alarmdetails">
   <soapenv:Header>
      <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
      				mustUnderstand="1">
      				<wsse:UsernameToken>
      					<wsse:Username>Prashanth</wsse:Username>
      					<wsse:Password>Reddy</wsse:Password>
      				</wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <soap:getAlarmByIdRequest>
         <soap:alarmid>10001</soap:alarmid>
      </soap:getAlarmByIdRequest>
   </soapenv:Body>
</soapenv:Envelope>